-- --------------------------------------------------
-- 修改基本表的结构
-- --------------------------------------------------


-- --------------------------------------------------
-- 修改客户表结构
-- --------------------------------------------------
ALTER TABLE 客户
ADD 电子邮件地址 VARCHAR(255) NULL;

ALTER TABLE 客户
MODIFY 客户名称 VARCHAR(100) NOT NULL;

ALTER TABLE 客户
DROP 电子邮件地址;


-- --------------------------------------------------
-- 修改订单表结构
-- --------------------------------------------------
ALTER TABLE 订单
ADD 发货日期 VARCHAR(10) NULL;

ALTER TABLE 订单
CHANGE 发货日期 送货日期 VARCHAR(10) NULL;

ALTER TABLE 订单
DROP 送货日期;


-- --------------------------------------------------
-- 修改订单细节表结构
-- --------------------------------------------------
ALTER TABLE 订单细节
ADD 折扣额 FLOAT NULL;

ALTER TABLE 订单细节
CHANGE 折扣额 折扣百分比 INT NULL;

ALTER TABLE 订单细节
DROP 折扣百分比;


-- --------------------------------------------------
-- 修改产品表结构
-- --------------------------------------------------
ALTER TABLE 产品
ADD 产品分类 VARCHAR(50) NULL;

ALTER TABLE 产品
CHANGE 产品分类 产品品质 INT NULL;

ALTER TABLE 产品
DROP 产品品质;
