-- --------------------------------------------------
-- 分组统计查询-带和不带分组选择条件
-- --------------------------------------------------


-- --------------------------------------------------
-- 带分组选择条件的查询-订单数量
-- --------------------------------------------------
SELECT 客户编号, COUNT(客户编号) AS 订单数量
FROM 订单
WHERE 订货日期 >= '2024-03-03'
GROUP BY 客户编号
ORDER BY 订单数量;



-- --------------------------------------------------
-- 不带分组选择条件的查询-订单数量
-- --------------------------------------------------
SELECT 客户编号, COUNT(客户编号) AS 订单数量
FROM 订单
GROUP BY 客户编号
ORDER BY 订单数量;

