-- --------------------------------------------------
-- 嵌套查询
-- --------------------------------------------------


-- --------------------------------------------------
-- 相关子查询
-- --------------------------------------------------
SELECT DISTINCT c.客户编号, c.客户名称
FROM 客户 c
JOIN 订单 o ON c.客户编号 = o.客户编号
JOIN 订单细节 od ON o.订单编号 = od.订单编号
WHERE od.数量 > (SELECT AVG(数量) FROM 订单细节 WHERE 订单细节.产品编号 = od.产品编号);



-- --------------------------------------------------
-- 不相关子查询
-- --------------------------------------------------
SELECT DISTINCT c.客户编号, c.客户名称
FROM 客户 c
JOIN 订单 o ON c.客户编号 = o.客户编号
JOIN 订单细节 od ON o.订单编号 = od.订单编号
WHERE od.时价 > (SELECT AVG(单价) FROM 产品);



-- --------------------------------------------------
-- 各种谓词引出的子查询
-- --------------------------------------------------
SELECT *
FROM 客户 c
WHERE EXISTS (SELECT 1 FROM 订单 o WHERE o.客户编号 = c.客户编号);

SELECT *
FROM 产品
WHERE 产品编号 IN (SELECT DISTINCT 产品编号 FROM 订单细节);
